 
Функция Плагины(Проект) Экспорт
	Плагины = Новый Массив;
	Выборка = Справочники.Радар_Плагины.Выбрать(, Проект);
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ПометкаУдаления Тогда
			Плагин = ВнешниеОбработки.Создать(Выборка.Путь, Ложь);
			Плагины.Добавить(Плагин);
		КонецЕсли; 
	КонецЦикла; 
	Возврат Плагины;
КонецФункции

Функция ОкружениеФормы() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("АвтоЗаголовок"));
	Переменные.Добавить(Радар_Типы.Метод("AutoTitle"));

	Переменные.Добавить(Радар_Типы.Переменная("АвтоматическоеСохранениеДанныхВНастройках"));
	Переменные.Добавить(Радар_Типы.Метод("AutoSaveDataInSettings"));

	Переменные.Добавить(Радар_Типы.Переменная("АвтоНавигационнаяСсылка"));
	Переменные.Добавить(Радар_Типы.Метод("AutoURL"));

	Переменные.Добавить(Радар_Типы.Переменная("ВертикальнаяПрокрутка"));
	Переменные.Добавить(Радар_Типы.Метод("VerticalScroll"));

	Переменные.Добавить(Радар_Типы.Переменная("ВертикальноеПоложениеПодчиненных"));
	Переменные.Добавить(Радар_Типы.Метод("ChildItemsVerticalAlign"));

	Переменные.Добавить(Радар_Типы.Переменная("ВертикальныйИнтервал"));
	Переменные.Добавить(Радар_Типы.Метод("VerticalSpacing"));

	Переменные.Добавить(Радар_Типы.Переменная("ВладелецФормы"));
	Переменные.Добавить(Радар_Типы.Метод("FormOwner"));

	Переменные.Добавить(Радар_Типы.Переменная("ВыравниваниеЭлементовИЗаголовков"));
	Переменные.Добавить(Радар_Типы.Метод("ItemsAndTitlesAlign"));

	Переменные.Добавить(Радар_Типы.Переменная("Высота"));
	Переменные.Добавить(Радар_Типы.Метод("Height"));

	Переменные.Добавить(Радар_Типы.Переменная("ГоризонтальноеПоложениеПодчиненных"));
	Переменные.Добавить(Радар_Типы.Метод("ChildItemsHorizontalAlign"));

	Переменные.Добавить(Радар_Типы.Переменная("ГоризонтальныйИнтервал"));
	Переменные.Добавить(Радар_Типы.Метод("HorizontalSpacing"));

	Переменные.Добавить(Радар_Типы.Переменная("Группировка"));
	Переменные.Добавить(Радар_Типы.Метод("Group"));

	Переменные.Добавить(Радар_Типы.Переменная("Доступность"));
	Переменные.Добавить(Радар_Типы.Метод("Enabled"));

	Переменные.Добавить(Радар_Типы.Переменная("Заголовок"));
	Переменные.Добавить(Радар_Типы.Метод("Title"));

	Переменные.Добавить(Радар_Типы.Переменная("ЗакрыватьПриВыборе"));
	Переменные.Добавить(Радар_Типы.Метод("CloseOnChoice"));

	Переменные.Добавить(Радар_Типы.Переменная("ЗакрыватьПриЗакрытииВладельца"));
	Переменные.Добавить(Радар_Типы.Метод("CloseOnOwnerClose"));

	Переменные.Добавить(Радар_Типы.Переменная("ИмяФормы"));
	Переменные.Добавить(Радар_Типы.Метод("FormName"));

	Переменные.Добавить(Радар_Типы.Переменная("КлючНазначенияИспользования"));
	Переменные.Добавить(Радар_Типы.Метод("PurposeUseKey"));

	Переменные.Добавить(Радар_Типы.Переменная("КлючСохраненияПоложенияОкна"));
	Переменные.Добавить(Радар_Типы.Метод("WindowOptionsKey"));

	Переменные.Добавить(Радар_Типы.Переменная("КлючУникальности"));
	Переменные.Добавить(Радар_Типы.Метод("UniqueKey"));

	Переменные.Добавить(Радар_Типы.Переменная("КоманднаяПанель"));
	Переменные.Добавить(Радар_Типы.Метод("CommandBar"));

	Переменные.Добавить(Радар_Типы.Переменная("Команды"));
	Переменные.Добавить(Радар_Типы.Метод("Commands"));

	Переменные.Добавить(Радар_Типы.Переменная("Масштаб"));
	Переменные.Добавить(Радар_Типы.Метод("Scale"));

	Переменные.Добавить(Радар_Типы.Переменная("МодальныйРежим"));
	Переменные.Добавить(Радар_Типы.Метод("ModalMode"));

	Переменные.Добавить(Радар_Типы.Переменная("Модифицированность"));
	Переменные.Добавить(Радар_Типы.Метод("Modified"));

	Переменные.Добавить(Радар_Типы.Переменная("НавигационнаяСсылка"));
	Переменные.Добавить(Радар_Типы.Метод("URL"));

	Переменные.Добавить(Радар_Типы.Переменная("Окно"));
	Переменные.Добавить(Радар_Типы.Метод("Window"));

	Переменные.Добавить(Радар_Типы.Переменная("ОписаниеОповещенияОЗакрытии"));
	Переменные.Добавить(Радар_Типы.Метод("OnCloseNotifyDescription"));

	Переменные.Добавить(Радар_Типы.Переменная("ОтображатьЗаголовок"));
	Переменные.Добавить(Радар_Типы.Метод("ShowTitle"));

	Переменные.Добавить(Радар_Типы.Переменная("ОтображатьКнопкуЗакрытия"));
	Переменные.Добавить(Радар_Типы.Метод("ShowCloseButton"));

	Переменные.Добавить(Радар_Типы.Переменная("ОтображениеОбсуждений"));
	Переменные.Добавить(Радар_Типы.Метод("ConversationsRepresentation"));

	Переменные.Добавить(Радар_Типы.Переменная("Параметры"));
	Переменные.Добавить(Радар_Типы.Метод("Parameters"));

	Переменные.Добавить(Радар_Типы.Переменная("ПоведениеКлавишиEnter"));
	Переменные.Добавить(Радар_Типы.Метод("EnterKeyBehavior"));

	Переменные.Добавить(Радар_Типы.Переменная("ПодчиненныеЭлементы"));
	Переменные.Добавить(Радар_Типы.Метод("ChildItems"));

	Переменные.Добавить(Радар_Типы.Переменная("ПоложениеКоманднойПанели"));
	Переменные.Добавить(Радар_Типы.Метод("CommandBarLocation"));

	Переменные.Добавить(Радар_Типы.Переменная("ПроверятьЗаполнениеАвтоматически"));
	Переменные.Добавить(Радар_Типы.Метод("AutoFillCheck"));

	Переменные.Добавить(Радар_Типы.Переменная("РежимОткрытияОкна"));
	Переменные.Добавить(Радар_Типы.Метод("WindowOpeningMode"));

	Переменные.Добавить(Радар_Типы.Переменная("СворачиваниеЭлементовПоВажности"));
	Переменные.Добавить(Радар_Типы.Метод("CollapseItemsByImportance"));

	Переменные.Добавить(Радар_Типы.Переменная("СоставКоманднойПанелиНаМобильномУстройстве"));
	Переменные.Добавить(Радар_Типы.Метод("MobileDeviceCommandBarContent"));

	Переменные.Добавить(Радар_Типы.Переменная("СохранениеДанныхВНастройках"));
	Переменные.Добавить(Радар_Типы.Метод("SaveDataInSettings"));

	Переменные.Добавить(Радар_Типы.Переменная("СохраняемыеВНастройкахДанныеМодифицированы"));
	Переменные.Добавить(Радар_Типы.Метод("SavedInSettingsDataModified"));

	Переменные.Добавить(Радар_Типы.Переменная("ТекущийЭлемент"));
	Переменные.Добавить(Радар_Типы.Метод("CurrentItem"));

	Переменные.Добавить(Радар_Типы.Переменная("ТолькоПросмотр"));
	Переменные.Добавить(Радар_Типы.Метод("ReadOnly"));

	Переменные.Добавить(Радар_Типы.Переменная("УникальныйИдентификатор"));
	Переменные.Добавить(Радар_Типы.Метод("UUID"));

	Переменные.Добавить(Радар_Типы.Переменная("УсловноеОформление"));
	Переменные.Добавить(Радар_Типы.Метод("ConditionalAppearance"));

	Переменные.Добавить(Радар_Типы.Переменная("Ширина"));
	Переменные.Добавить(Радар_Типы.Метод("Width"));

	Переменные.Добавить(Радар_Типы.Переменная("Элементы"));
	Переменные.Добавить(Радар_Типы.Метод("Items"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Метод("ThisObject"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтаФорма"));
	Переменные.Добавить(Радар_Типы.Метод("ThisForm"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Активизировать"));
	Методы.Добавить(Радар_Типы.Метод("Activate"));

	Методы.Добавить(Радар_Типы.Метод("ВводДоступен"));
	Методы.Добавить(Радар_Типы.Метод("IsInputAvailable"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьИзМеню"));
	Методы.Добавить(Радар_Типы.Метод("ChooseFromMenu"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьИзСписка"));
	Методы.Добавить(Радар_Типы.Метод("ChooseFromList"));

	Методы.Добавить(Радар_Типы.Метод("ВыполнитьПереход"));
	Методы.Добавить(Радар_Типы.Метод("ExecuteNavigation"));

	Методы.Добавить(Радар_Типы.Метод("ЗаблокироватьДанныеФормыДляРедактирования"));
	Методы.Добавить(Радар_Типы.Метод("LockFormDataForEdit"));

	Методы.Добавить(Радар_Типы.Метод("Закрыть"));
	Методы.Добавить(Радар_Типы.Метод("Close"));

	Методы.Добавить(Радар_Типы.Метод("ЗаполнитьПриПереоткрытииСДругогоСервера"));
	Методы.Добавить(Радар_Типы.Метод("FillOnReopenFromOtherServer"));

	Методы.Добавить(Радар_Типы.Метод("ЗначениеВРеквизитФормы"));
	Методы.Добавить(Радар_Типы.Метод("ValueToFormAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ИзменитьРеквизиты"));
	Методы.Добавить(Радар_Типы.Метод("ChangeAttributes"));

	Методы.Добавить(Радар_Типы.Метод("НачатьПолучениеОбсуждения"));
	Методы.Добавить(Радар_Типы.Метод("BeginGetConversation"));

	Методы.Добавить(Радар_Типы.Метод("НачатьРедактированиеЭлемента"));
	Методы.Добавить(Радар_Типы.Метод("BeginEditingItem"));

	Методы.Добавить(Радар_Типы.Метод("ОбновитьОтображениеДанных"));
	Методы.Добавить(Радар_Типы.Метод("RefreshDataRepresentation"));

	Методы.Добавить(Радар_Типы.Метод("ОповеститьОбАктивизации"));
	Методы.Добавить(Радар_Типы.Метод("NotifyActivate"));

	Методы.Добавить(Радар_Типы.Метод("ОповеститьОВыборе"));
	Методы.Добавить(Радар_Типы.Метод("NotifyChoice"));

	Методы.Добавить(Радар_Типы.Метод("ОповеститьОЗаписиНового"));
	Методы.Добавить(Радар_Типы.Метод("NotifyWritingNew"));

	Методы.Добавить(Радар_Типы.Метод("ОтключитьОбработчикОжидания"));
	Методы.Добавить(Радар_Типы.Метод("DetachIdleHandler"));

	Методы.Добавить(Радар_Типы.Метод("ОтключитьОтметкуНезаполненного"));
	Методы.Добавить(Радар_Типы.Метод("ClearMarkIncomplete"));

	Методы.Добавить(Радар_Типы.Метод("Открыта"));
	Методы.Добавить(Радар_Типы.Метод("IsOpen"));

	Методы.Добавить(Радар_Типы.Метод("Открыть"));
	Методы.Добавить(Радар_Типы.Метод("Open"));

	Методы.Добавить(Радар_Типы.Метод("ОткрытьМодально"));
	Методы.Добавить(Радар_Типы.Метод("DoModal"));

	Методы.Добавить(Радар_Типы.Метод("ОткрытьСправкуФормы"));
	Методы.Добавить(Радар_Типы.Метод("OpenFormHelp"));

	Методы.Добавить(Радар_Типы.Метод("ОтобразитьИзменениеДанных"));
	Методы.Добавить(Радар_Типы.Метод("RepresentDataChange"));

	Методы.Добавить(Радар_Типы.Метод("ПереоткрытьСДругогоСервера"));
	Методы.Добавить(Радар_Типы.Метод("ReopenFromOtherServer"));

	Методы.Добавить(Радар_Типы.Метод("ПодключитьОбработчикОжидания"));
	Методы.Добавить(Радар_Типы.Метод("AttachIdleHandler"));

	Методы.Добавить(Радар_Типы.Метод("ПоказатьВыборИзМеню"));
	Методы.Добавить(Радар_Типы.Метод("ShowChooseFromMenu"));

	Методы.Добавить(Радар_Типы.Метод("ПоказатьВыборИзСписка"));
	Методы.Добавить(Радар_Типы.Метод("ShowChooseFromList"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДействие"));
	Методы.Добавить(Радар_Типы.Метод("GetAction"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьПараметрыФункциональныхОпцийФормы"));
	Методы.Добавить(Радар_Типы.Метод("GetFormFunctionalOptionParameters"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьРеквизиты"));
	Методы.Добавить(Радар_Типы.Метод("GetAttributes"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФункциональнуюОпциюФормы"));
	Методы.Добавить(Радар_Типы.Метод("GetFormFunctionalOption"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("РазблокироватьДанныеФормыДляРедактирования"));
	Методы.Добавить(Радар_Типы.Метод("UnlockFormDataForEdit"));

	Методы.Добавить(Радар_Типы.Метод("РеквизитФормыВЗначение"));
	Методы.Добавить(Радар_Типы.Метод("FormAttributeToValue"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьВыполнениеОбработчиковСобытия"));
	Методы.Добавить(Радар_Типы.Метод("SetEventHandlersExecution"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьВыполнениеПослеОбработчиковСобытия"));
	Методы.Добавить(Радар_Типы.Метод("SetExecutionAfterEventHandlers"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьДействие"));
	Методы.Добавить(Радар_Типы.Метод("SetAction"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПараметрыФункциональныхОпцийФормы"));
	Методы.Добавить(Радар_Типы.Метод("SetFormFunctionalOptionParameters"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#Область Справочник

Функция ОкружениеФормыСправочника() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ВыборДоступен"));
	Переменные.Добавить(Радар_Типы.Переменная("ChoiceAvailable"));

	Переменные.Добавить(Радар_Типы.Переменная("ИспользованиеДляГруппИЭлементов"));
	Переменные.Добавить(Радар_Типы.Переменная("UseForFoldersAndItems"));

	Переменные.Добавить(Радар_Типы.Переменная("ПараметрыВыбора"));
	Переменные.Добавить(Радар_Типы.Переменная("ChoiceParameters"));

	Переменные.Добавить(Радар_Типы.Переменная("РежимВыбора"));
	Переменные.Добавить(Радар_Типы.Переменная("ChoiceMode"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеОбъектаСправочника() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ВерсияДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataVersion"));

	Переменные.Добавить(Радар_Типы.Переменная("Владелец"));
	Переменные.Добавить(Радар_Типы.Переменная("Owner"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("ЗаписьИсторииДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("WriteDataHistory"));

	Переменные.Добавить(Радар_Типы.Переменная("ИмяПредопределенныхДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("PredefinedDataName"));

	Переменные.Добавить(Радар_Типы.Переменная("Код"));
	Переменные.Добавить(Радар_Типы.Переменная("Code"));

	Переменные.Добавить(Радар_Типы.Переменная("Наименование"));
	Переменные.Добавить(Радар_Типы.Переменная("Description"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ПометкаУдаления"));
	Переменные.Добавить(Радар_Типы.Переменная("DeletionMark"));

	Переменные.Добавить(Радар_Типы.Переменная("Предопределенный"));
	Переменные.Добавить(Радар_Типы.Переменная("Predefined"));

	Переменные.Добавить(Радар_Типы.Переменная("Родитель"));
	Переменные.Добавить(Радар_Типы.Переменная("Parent"));

	Переменные.Добавить(Радар_Типы.Переменная("Ссылка"));
	Переменные.Добавить(Радар_Типы.Переменная("Ref"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтоГруппа"));
	Переменные.Добавить(Радар_Типы.Переменная("IsFolder"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Заблокирован"));
	Методы.Добавить(Радар_Типы.Метод("IsLocked"));

	Методы.Добавить(Радар_Типы.Метод("Заблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Lock"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("ПолноеНаименование"));
	Методы.Добавить(Радар_Типы.Метод("FullDescr"));

	Методы.Добавить(Радар_Типы.Метод("ПолныйКод"));
	Методы.Добавить(Радар_Типы.Метод("FullCode"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("GetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПринадлежитЭлементу"));
	Методы.Добавить(Радар_Типы.Метод("BelongsToItem"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Разблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Unlock"));

	Методы.Добавить(Радар_Типы.Метод("Скопировать"));
	Методы.Добавить(Радар_Типы.Метод("Copy"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("Уровень"));
	Методы.Добавить(Радар_Типы.Метод("Level"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьНовыйКод"));
	Методы.Добавить(Радар_Типы.Метод("SetNewCode"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПометкуУдаления"));
	Методы.Добавить(Радар_Типы.Метод("SetDeletionMark"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("SetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ЭтоНовый"));
	Методы.Добавить(Радар_Типы.Метод("IsNew"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераСправочника() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьИерархически"));
	Методы.Добавить(Радар_Типы.Метод("SelectHierarchically"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоКоду"));
	Методы.Добавить(Радар_Типы.Метод("FindByCode"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНаименованию"));
	Методы.Добавить(Радар_Типы.Метод("FindByDescription"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоРеквизиту"));
	Методы.Добавить(Радар_Типы.Метод("FindByAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИнициализациюПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetPredefinedDataInitialization"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьОбновлениеПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetPredefinedDataUpdate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылку"));
	Методы.Добавить(Радар_Типы.Метод("GetRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбораГруппы"));
	Методы.Добавить(Радар_Типы.Метод("GetFolderChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовогоЭлемента"));
	Методы.Добавить(Радар_Типы.Метод("GetNewItemForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовойГруппы"));
	Методы.Добавить(Радар_Типы.Метод("GetNewFolderForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылка"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRef"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьГруппу"));
	Методы.Добавить(Радар_Типы.Метод("CreateFolder"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьЭлемент"));
	Методы.Добавить(Радар_Типы.Метод("CreateItem"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИнициализациюПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetPredefinedDataInitialization"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьОбновлениеПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetPredefinedDataUpdate"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область ПланСчетов

Функция ОкружениеОбъектаПланаСчетов() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ВерсияДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataVersion"));

	Переменные.Добавить(Радар_Типы.Переменная("Вид"));
	Переменные.Добавить(Радар_Типы.Переменная("Type"));

	Переменные.Добавить(Радар_Типы.Переменная("ВидыСубконто"));
	Переменные.Добавить(Радар_Типы.Переменная("ExtDimensionTypes"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Забалансовый"));
	Переменные.Добавить(Радар_Типы.Переменная("OffBalance"));

	Переменные.Добавить(Радар_Типы.Переменная("ИмяПредопределенныхДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("PredefinedDataName"));

	Переменные.Добавить(Радар_Типы.Переменная("Код"));
	Переменные.Добавить(Радар_Типы.Переменная("Code"));

	Переменные.Добавить(Радар_Типы.Переменная("Наименование"));
	Переменные.Добавить(Радар_Типы.Переменная("Description"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ПометкаУдаления"));
	Переменные.Добавить(Радар_Типы.Переменная("DeletionMark"));

	Переменные.Добавить(Радар_Типы.Переменная("Порядок"));
	Переменные.Добавить(Радар_Типы.Переменная("Order"));

	Переменные.Добавить(Радар_Типы.Переменная("Предопределенный"));
	Переменные.Добавить(Радар_Типы.Переменная("Predefined"));

	Переменные.Добавить(Радар_Типы.Переменная("Родитель"));
	Переменные.Добавить(Радар_Типы.Переменная("Parent"));

	Переменные.Добавить(Радар_Типы.Переменная("Ссылка"));
	Переменные.Добавить(Радар_Типы.Переменная("Ref"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Заблокирован"));
	Методы.Добавить(Радар_Типы.Метод("IsLocked"));

	Методы.Добавить(Радар_Типы.Метод("Заблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Lock"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьПорядокКода"));
	Методы.Добавить(Радар_Типы.Метод("GetCodeOrder"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("GetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПринадлежитЭлементу"));
	Методы.Добавить(Радар_Типы.Метод("BelongsToItem"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Разблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Unlock"));

	Методы.Добавить(Радар_Типы.Метод("Скопировать"));
	Методы.Добавить(Радар_Типы.Метод("Copy"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("Уровень"));
	Методы.Добавить(Радар_Типы.Метод("Level"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПометкуУдаления"));
	Методы.Добавить(Радар_Типы.Метод("SetDeletionMark"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("SetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ЭтоНовый"));
	Методы.Добавить(Радар_Типы.Метод("IsNew"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераПланаСчетов() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьИерархически"));
	Методы.Добавить(Радар_Типы.Метод("SelectHierarchically"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоКоду"));
	Методы.Добавить(Радар_Типы.Метод("FindByCode"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНаименованию"));
	Методы.Добавить(Радар_Типы.Метод("FindByDescription"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоРеквизиту"));
	Методы.Добавить(Радар_Типы.Метод("FindByAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИнициализациюПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetPredefinedDataInitialization"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьОбновлениеПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetPredefinedDataUpdate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылку"));
	Методы.Добавить(Радар_Типы.Метод("GetRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовогоСчета"));
	Методы.Добавить(Радар_Типы.Метод("GetNewAccountForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылка"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRef"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьСчет"));
	Методы.Добавить(Радар_Типы.Метод("CreateAccount"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИнициализациюПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetPredefinedDataInitialization"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьОбновлениеПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetPredefinedDataUpdate"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область ПланОбмена

Функция ОкружениеОбъектаПланаОбмена() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ВерсияДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataVersion"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Код"));
	Переменные.Добавить(Радар_Типы.Переменная("Code"));

	Переменные.Добавить(Радар_Типы.Переменная("Наименование"));
	Переменные.Добавить(Радар_Типы.Переменная("Description"));

	Переменные.Добавить(Радар_Типы.Переменная("НомерОтправленного"));
	Переменные.Добавить(Радар_Типы.Переменная("SentNo"));

	Переменные.Добавить(Радар_Типы.Переменная("НомерПринятого"));
	Переменные.Добавить(Радар_Типы.Переменная("ReceivedNo"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ПометкаУдаления"));
	Переменные.Добавить(Радар_Типы.Переменная("DeletionMark"));

	Переменные.Добавить(Радар_Типы.Переменная("Ссылка"));
	Переменные.Добавить(Радар_Типы.Переменная("Ref"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотУзел"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisNode"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Заблокирован"));
	Методы.Добавить(Радар_Типы.Метод("IsLocked"));

	Методы.Добавить(Радар_Типы.Метод("Заблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Lock"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("GetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Разблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Unlock"));

	Методы.Добавить(Радар_Типы.Метод("Скопировать"));
	Методы.Добавить(Радар_Типы.Метод("Copy"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьНовыйКод"));
	Методы.Добавить(Радар_Типы.Метод("SetNewCode"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПометкуУдаления"));
	Методы.Добавить(Радар_Типы.Метод("SetDeletionMark"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("SetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ЭтоНовый"));
	Методы.Добавить(Радар_Типы.Метод("IsNew"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераПланаОбмена() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоКоду"));
	Методы.Добавить(Радар_Типы.Метод("FindByCode"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНаименованию"));
	Методы.Добавить(Радар_Типы.Метод("FindByDescription"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоРеквизиту"));
	Методы.Добавить(Радар_Типы.Метод("FindByAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылку"));
	Методы.Добавить(Радар_Типы.Метод("GetRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовогоУзла"));
	Методы.Добавить(Радар_Типы.Метод("GetNewNodeForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылка"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRef"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьУзел"));
	Методы.Добавить(Радар_Типы.Метод("CreateNode"));

	Методы.Добавить(Радар_Типы.Метод("ЭтотУзел"));
	Методы.Добавить(Радар_Типы.Метод("ThisNode"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область ПланВидовХарактеристик

Функция ОкружениеОбъектаПланаВидовХарактеристик() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ВерсияДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataVersion"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("ИмяПредопределенныхДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("PredefinedDataName"));

	Переменные.Добавить(Радар_Типы.Переменная("Код"));
	Переменные.Добавить(Радар_Типы.Переменная("Code"));

	Переменные.Добавить(Радар_Типы.Переменная("Наименование"));
	Переменные.Добавить(Радар_Типы.Переменная("Description"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ПометкаУдаления"));
	Переменные.Добавить(Радар_Типы.Переменная("DeletionMark"));

	Переменные.Добавить(Радар_Типы.Переменная("Предопределенный"));
	Переменные.Добавить(Радар_Типы.Переменная("Predefined"));

	Переменные.Добавить(Радар_Типы.Переменная("Родитель"));
	Переменные.Добавить(Радар_Типы.Переменная("Parent"));

	Переменные.Добавить(Радар_Типы.Переменная("Ссылка"));
	Переменные.Добавить(Радар_Типы.Переменная("Ref"));

	Переменные.Добавить(Радар_Типы.Переменная("ТипЗначения"));
	Переменные.Добавить(Радар_Типы.Переменная("ValueType"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтоГруппа"));
	Переменные.Добавить(Радар_Типы.Переменная("IsFolder"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Заблокирован"));
	Методы.Добавить(Радар_Типы.Метод("IsLocked"));

	Методы.Добавить(Радар_Типы.Метод("Заблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Lock"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("GetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПринадлежитЭлементу"));
	Методы.Добавить(Радар_Типы.Метод("BelongsToItem"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Разблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Unlock"));

	Методы.Добавить(Радар_Типы.Метод("Скопировать"));
	Методы.Добавить(Радар_Типы.Метод("Copy"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("Уровень"));
	Методы.Добавить(Радар_Типы.Метод("Level"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьНовыйКод"));
	Методы.Добавить(Радар_Типы.Метод("SetNewCode"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПометкуУдаления"));
	Методы.Добавить(Радар_Типы.Метод("SetDeletionMark"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("SetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ЭтоНовый"));
	Методы.Добавить(Радар_Типы.Метод("IsNew"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераПланаВидовХарактеристик() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьИерархически"));
	Методы.Добавить(Радар_Типы.Метод("SelectHierarchically"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоКоду"));
	Методы.Добавить(Радар_Типы.Метод("FindByCode"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНаименованию"));
	Методы.Добавить(Радар_Типы.Метод("FindByDescription"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоРеквизиту"));
	Методы.Добавить(Радар_Типы.Метод("FindByAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИнициализациюПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetPredefinedDataInitialization"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьОбновлениеПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetPredefinedDataUpdate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылку"));
	Методы.Добавить(Радар_Типы.Метод("GetRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбораГруппы"));
	Методы.Добавить(Радар_Типы.Метод("GetFolderChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовогоЭлемента"));
	Методы.Добавить(Радар_Типы.Метод("GetNewItemForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовойГруппы"));
	Методы.Добавить(Радар_Типы.Метод("GetNewFolderForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылка"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRef"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьГруппу"));
	Методы.Добавить(Радар_Типы.Метод("CreateFolder"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьЭлемент"));
	Методы.Добавить(Радар_Типы.Метод("CreateItem"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИнициализациюПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetPredefinedDataInitialization"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьОбновлениеПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetPredefinedDataUpdate"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область ПланВидовРасчета

Функция ОкружениеОбъектаПланаВидовРасчета() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("БазовыеВидыРасчета"));
	Переменные.Добавить(Радар_Типы.Переменная("BaseCalculationTypes"));

	Переменные.Добавить(Радар_Типы.Переменная("ВедущиеВидыРасчета"));
	Переменные.Добавить(Радар_Типы.Переменная("LeadingCalculationTypes"));

	Переменные.Добавить(Радар_Типы.Переменная("ВерсияДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataVersion"));

	Переменные.Добавить(Радар_Типы.Переменная("ВытесняющиеВидыРасчета"));
	Переменные.Добавить(Радар_Типы.Переменная("DisplacingCalculationTypes"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("ИмяПредопределенныхДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("PredefinedDataName"));

	Переменные.Добавить(Радар_Типы.Переменная("Код"));
	Переменные.Добавить(Радар_Типы.Переменная("Code"));

	Переменные.Добавить(Радар_Типы.Переменная("Наименование"));
	Переменные.Добавить(Радар_Типы.Переменная("Description"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ПериодДействияБазовый"));
	Переменные.Добавить(Радар_Типы.Переменная("ActionPeriodIsBasic"));

	Переменные.Добавить(Радар_Типы.Переменная("ПометкаУдаления"));
	Переменные.Добавить(Радар_Типы.Переменная("DeletionMark"));

	Переменные.Добавить(Радар_Типы.Переменная("Предопределенный"));
	Переменные.Добавить(Радар_Типы.Переменная("Predefined"));

	Переменные.Добавить(Радар_Типы.Переменная("Ссылка"));
	Переменные.Добавить(Радар_Типы.Переменная("Ref"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Заблокирован"));
	Методы.Добавить(Радар_Типы.Метод("IsLocked"));

	Методы.Добавить(Радар_Типы.Метод("Заблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Lock"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("GetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Разблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Unlock"));

	Методы.Добавить(Радар_Типы.Метод("Скопировать"));
	Методы.Добавить(Радар_Типы.Метод("Copy"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПометкуУдаления"));
	Методы.Добавить(Радар_Типы.Метод("SetDeletionMark"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("SetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ЭтоНовый"));
	Методы.Добавить(Радар_Типы.Метод("IsNew"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераПланаВидовРасчета() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоКоду"));
	Методы.Добавить(Радар_Типы.Метод("FindByCode"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНаименованию"));
	Методы.Добавить(Радар_Типы.Метод("FindByDescription"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоРеквизиту"));
	Методы.Добавить(Радар_Типы.Метод("FindByAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИнициализациюПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetPredefinedDataInitialization"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьОбновлениеПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetPredefinedDataUpdate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылку"));
	Методы.Добавить(Радар_Типы.Метод("GetRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовогоВидаРасчета"));
	Методы.Добавить(Радар_Типы.Метод("GetNewCalculationTypeForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылка"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRef"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьВидРасчета"));
	Методы.Добавить(Радар_Типы.Метод("CreateCalculationType"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИнициализациюПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetPredefinedDataInitialization"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьОбновлениеПредопределенныхДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetPredefinedDataUpdate"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область БизнесПроцесс

Функция ОкружениеОбъектаБизнесПроцесса() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ВедущаяЗадача"));
	Переменные.Добавить(Радар_Типы.Переменная("HeadTask"));

	Переменные.Добавить(Радар_Типы.Переменная("ВерсияДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataVersion"));

	Переменные.Добавить(Радар_Типы.Переменная("Дата"));
	Переменные.Добавить(Радар_Типы.Переменная("Date"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Завершен"));
	Переменные.Добавить(Радар_Типы.Переменная("Completed"));

	Переменные.Добавить(Радар_Типы.Переменная("Номер"));
	Переменные.Добавить(Радар_Типы.Переменная("Number"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ПометкаУдаления"));
	Переменные.Добавить(Радар_Типы.Переменная("DeletionMark"));

	Переменные.Добавить(Радар_Типы.Переменная("Ссылка"));
	Переменные.Добавить(Радар_Типы.Переменная("Ref"));

	Переменные.Добавить(Радар_Типы.Переменная("Стартован"));
	Переменные.Добавить(Радар_Типы.Переменная("Started"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("АктивироватьИнтерактивно"));
	Методы.Добавить(Радар_Типы.Метод("ActivateInteractively"));

	Методы.Добавить(Радар_Типы.Метод("Заблокирован"));
	Методы.Добавить(Радар_Типы.Метод("IsLocked"));

	Методы.Добавить(Радар_Типы.Метод("Заблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Lock"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКартуМаршрута"));
	Методы.Добавить(Радар_Типы.Метод("GetFlowchart"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("GetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Разблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Unlock"));

	Методы.Добавить(Радар_Типы.Метод("Скопировать"));
	Методы.Добавить(Радар_Типы.Метод("Copy"));

	Методы.Добавить(Радар_Типы.Метод("Старт"));
	Методы.Добавить(Радар_Типы.Метод("Start"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьВремя"));
	Методы.Добавить(Радар_Типы.Метод("SetTime"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьНовыйНомер"));
	Методы.Добавить(Радар_Типы.Метод("SetNewNumber"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПометкуУдаления"));
	Методы.Добавить(Радар_Типы.Метод("SetDeletionMark"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("SetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ЭтоНовый"));
	Методы.Добавить(Радар_Типы.Метод("IsNew"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераБизнесПроцесса() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ТочкиМаршрута"));
	Переменные.Добавить(Радар_Типы.Переменная("RoutePoints"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНомеру"));
	Методы.Добавить(Радар_Типы.Метод("FindByNumber"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоРеквизиту"));
	Методы.Добавить(Радар_Типы.Метод("FindByAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКартуМаршрута"));
	Методы.Добавить(Радар_Типы.Метод("GetFlowchart"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылку"));
	Методы.Добавить(Радар_Типы.Метод("GetRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовогоБизнесПроцесса"));
	Методы.Добавить(Радар_Типы.Метод("GetNewBusinessProcessForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылка"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRef"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылкаНаТочкуМаршрута"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRoutePointRef"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьБизнесПроцесс"));
	Методы.Добавить(Радар_Типы.Метод("CreateBusinessProcess"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область Задача

Функция ОкружениеОбъектаЗадачи() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("БизнесПроцесс"));
	Переменные.Добавить(Радар_Типы.Переменная("BusinessProcess"));

	Переменные.Добавить(Радар_Типы.Переменная("ВерсияДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataVersion"));

	Переменные.Добавить(Радар_Типы.Переменная("Выполнена"));
	Переменные.Добавить(Радар_Типы.Переменная("Executed"));

	Переменные.Добавить(Радар_Типы.Переменная("Дата"));
	Переменные.Добавить(Радар_Типы.Переменная("Date"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Наименование"));
	Переменные.Добавить(Радар_Типы.Переменная("Description"));

	Переменные.Добавить(Радар_Типы.Переменная("Номер"));
	Переменные.Добавить(Радар_Типы.Переменная("Number"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ПометкаУдаления"));
	Переменные.Добавить(Радар_Типы.Переменная("DeletionMark"));

	Переменные.Добавить(Радар_Типы.Переменная("Ссылка"));
	Переменные.Добавить(Радар_Типы.Переменная("Ref"));

	Переменные.Добавить(Радар_Типы.Переменная("ТочкаМаршрута"));
	Переменные.Добавить(Радар_Типы.Переменная("RoutePoint"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("АктивироватьИнтерактивно"));
	Методы.Добавить(Радар_Типы.Метод("ActivateInteractively"));

	Методы.Добавить(Радар_Типы.Метод("ВыполнитьЗадачу"));
	Методы.Добавить(Радар_Типы.Метод("ExecuteTask"));

	Методы.Добавить(Радар_Типы.Метод("ВыполнитьЗадачуИнтерактивно"));
	Методы.Добавить(Радар_Типы.Метод("ExecuteTaskInteractively"));

	Методы.Добавить(Радар_Типы.Метод("Заблокирован"));
	Методы.Добавить(Радар_Типы.Метод("IsLocked"));

	Методы.Добавить(Радар_Типы.Метод("Заблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Lock"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("GetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьВыполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckExecution"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Разблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Unlock"));

	Методы.Добавить(Радар_Типы.Метод("Скопировать"));
	Методы.Добавить(Радар_Типы.Метод("Copy"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьВремя"));
	Методы.Добавить(Радар_Типы.Метод("SetTime"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьНовыйНомер"));
	Методы.Добавить(Радар_Типы.Метод("SetNewNumber"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПометкуУдаления"));
	Методы.Добавить(Радар_Типы.Метод("SetDeletionMark"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("SetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ЭтоНовый"));
	Методы.Добавить(Радар_Типы.Метод("IsNew"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераЗадачи() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	//Переменные = Окружение.Переменные;
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНаименованию"));
	Методы.Добавить(Радар_Типы.Метод("FindByDescription"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНомеру"));
	Методы.Добавить(Радар_Типы.Метод("FindByNumber"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоРеквизиту"));
	Методы.Добавить(Радар_Типы.Метод("FindByAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылку"));
	Методы.Добавить(Радар_Типы.Метод("GetRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовойЗадачи"));
	Методы.Добавить(Радар_Типы.Метод("GetNewTaskForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылка"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRef"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьЗадачу"));
	Методы.Добавить(Радар_Типы.Метод("CreateTask"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область Документ

Функция ОкружениеФормыДокумента() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("АвтоВремя"));
	Переменные.Добавить(Радар_Типы.Переменная("AutoTime"));

	Переменные.Добавить(Радар_Типы.Переменная("ВыборДоступен"));
	Переменные.Добавить(Радар_Типы.Переменная("ChoiceAvailable"));

	Переменные.Добавить(Радар_Типы.Переменная("ИспользоватьРежимПроведения"));
	Переменные.Добавить(Радар_Типы.Переменная("UsePostingMode"));

	Переменные.Добавить(Радар_Типы.Переменная("ПараметрыВыбора"));
	Переменные.Добавить(Радар_Типы.Переменная("ChoiceParameters"));

	Переменные.Добавить(Радар_Типы.Переменная("ПриЗаписиПерепроводить"));
	Переменные.Добавить(Радар_Типы.Переменная("RepostOnWrite"));

	Переменные.Добавить(Радар_Типы.Переменная("РежимВыбора"));
	Переменные.Добавить(Радар_Типы.Переменная("ChoiceMode"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеОбъектаДокумента() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ВерсияДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataVersion"));

	Переменные.Добавить(Радар_Типы.Переменная("Дата"));
	Переменные.Добавить(Радар_Типы.Переменная("Date"));

	Переменные.Добавить(Радар_Типы.Переменная("Движения"));
	Переменные.Добавить(Радар_Типы.Переменная("RegisterRecords"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("ЗаписьИсторииДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("WriteDataHistory"));

	Переменные.Добавить(Радар_Типы.Переменная("Номер"));
	Переменные.Добавить(Радар_Типы.Переменная("Number"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ПометкаУдаления"));
	Переменные.Добавить(Радар_Типы.Переменная("DeletionMark"));

	Переменные.Добавить(Радар_Типы.Переменная("ПринадлежностьПоследовательностям"));
	Переменные.Добавить(Радар_Типы.Переменная("BelongingToSequences"));

	Переменные.Добавить(Радар_Типы.Переменная("Проведен"));
	Переменные.Добавить(Радар_Типы.Переменная("Posted"));

	Переменные.Добавить(Радар_Типы.Переменная("Ссылка"));
	Переменные.Добавить(Радар_Типы.Переменная("Ref"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Заблокирован"));
	Методы.Добавить(Радар_Типы.Метод("IsLocked"));

	Методы.Добавить(Радар_Типы.Метод("Заблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Lock"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("МоментВремени"));
	Методы.Добавить(Радар_Типы.Метод("PointInTime"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("GetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Разблокировать"));
	Методы.Добавить(Радар_Типы.Метод("Unlock"));

	Методы.Добавить(Радар_Типы.Метод("Скопировать"));
	Методы.Добавить(Радар_Типы.Метод("Copy"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьВремя"));
	Методы.Добавить(Радар_Типы.Метод("SetTime"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьНовыйНомер"));
	Методы.Добавить(Радар_Типы.Метод("SetNewNumber"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьПометкуУдаления"));
	Методы.Добавить(Радар_Типы.Метод("SetDeletionMark"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьСсылкуНового"));
	Методы.Добавить(Радар_Типы.Метод("SetNewObjectRef"));

	Методы.Добавить(Радар_Типы.Метод("ЭтоНовый"));
	Методы.Добавить(Радар_Типы.Метод("IsNew"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераДокумента() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоНомеру"));
	Методы.Добавить(Радар_Типы.Метод("FindByNumber"));

	Методы.Добавить(Радар_Типы.Метод("НайтиПоРеквизиту"));
	Методы.Добавить(Радар_Типы.Метод("FindByAttribute"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьСсылку"));
	Методы.Добавить(Радар_Типы.Метод("GetRef"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуВыбора"));
	Методы.Добавить(Радар_Типы.Метод("GetChoiceForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНовогоДокумента"));
	Методы.Добавить(Радар_Типы.Метод("GetNewDocumentForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустаяСсылка"));
	Методы.Добавить(Радар_Типы.Метод("EmptyRef"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьДокумент"));
	Методы.Добавить(Радар_Типы.Метод("CreateDocument"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область Отчет

Функция ОкружениеФормыОтчета() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("АвтоОтображениеСостояния"));
	Переменные.Добавить(Радар_Типы.Переменная("AutoShowState"));

	Переменные.Добавить(Радар_Типы.Переменная("ВариантМодифицирован"));
	Переменные.Добавить(Радар_Типы.Переменная("VariantModified"));

	Переменные.Добавить(Радар_Типы.Переменная("КлючТекущегоВарианта"));
	Переменные.Добавить(Радар_Типы.Переменная("CurrentVariantKey"));

	Переменные.Добавить(Радар_Типы.Переменная("КлючТекущихПользовательскихНастроек"));
	Переменные.Добавить(Радар_Типы.Переменная("CurrentUserSettingsKey"));

	Переменные.Добавить(Радар_Типы.Переменная("ПользовательскиеНастройкиМодифицированы"));
	Переменные.Добавить(Радар_Типы.Переменная("UserSettingsModified"));

	Переменные.Добавить(Радар_Типы.Переменная("ПредставлениеТекущегоВарианта"));
	Переменные.Добавить(Радар_Типы.Переменная("CurrentVariantPresentation"));

	Переменные.Добавить(Радар_Типы.Переменная("ПредставлениеТекущихПользовательскихНастроек"));
	Переменные.Добавить(Радар_Типы.Переменная("CurrentUserSettingsPresentation"));

	Переменные.Добавить(Радар_Типы.Переменная("РежимОтображенияРезультата"));
	Переменные.Добавить(Радар_Типы.Переменная("ResultViewMode"));

	Переменные.Добавить(Радар_Типы.Переменная("ТипФормыОтчета"));
	Переменные.Добавить(Радар_Типы.Переменная("ReportFormType"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("СкомпоноватьРезультат"));
	Методы.Добавить(Радар_Типы.Метод("ComposeResult"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьЭлементыФормыПользовательскихНастроек"));
	Методы.Добавить(Радар_Типы.Метод("CreateUserSettingsFormElements"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьТекущиеПользовательскиеНастройки"));
	Методы.Добавить(Радар_Типы.Метод("SetCurrentUserSettings"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьТекущийВариант"));
	Методы.Добавить(Радар_Типы.Метод("SetCurrentVariant"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеОбъектаОтчета() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("КомпоновщикНастроек"));
	Переменные.Добавить(Радар_Типы.Переменная("SettingsComposer"));

	Переменные.Добавить(Радар_Типы.Переменная("СхемаКомпоновкиДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("DataCompositionSchema"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуНастроек"));
	Методы.Добавить(Радар_Типы.Метод("GetSettingsForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("СкомпоноватьРезультат"));
	Методы.Добавить(Радар_Типы.Метод("ComposeResult"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераОтчета() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("Создать"));
	Методы.Добавить(Радар_Типы.Метод("Create"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область Обработка

Функция ОкружениеФормыОбработки() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	//Переменные = Окружение.Переменные;
	
	//Методы = Окружение.Методы;
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеОбъектаОбработки() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераОбработки() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("Создать"));
	Методы.Добавить(Радар_Типы.Метод("Create"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область РегистрНакопления

Функция ОкружениеНабораЗаписейРегистраНакопления() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;

	Переменные.Добавить(Радар_Типы.Переменная("БлокироватьДляИзменения"));
	Переменные.Добавить(Радар_Типы.Переменная("LockForUpdate"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Записывать"));
	Переменные.Добавить(Радар_Типы.Переменная("Write"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("Отбор"));
	Переменные.Добавить(Радар_Типы.Переменная("Filter"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Вставить"));
	Методы.Добавить(Радар_Типы.Метод("Insert"));

	Методы.Добавить(Радар_Типы.Метод("Выбран"));
	Методы.Добавить(Радар_Типы.Метод("Selected"));

	Методы.Добавить(Радар_Типы.Метод("Выгрузить"));
	Методы.Добавить(Радар_Типы.Метод("Unload"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонки"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumns"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Добавить"));
	Методы.Добавить(Радар_Типы.Метод("Add"));

	Методы.Добавить(Радар_Типы.Метод("ДобавитьПриход"));
	Методы.Добавить(Радар_Типы.Метод("AddReceipt"));

	Методы.Добавить(Радар_Типы.Метод("ДобавитьРасход"));
	Методы.Добавить(Радар_Типы.Метод("AddExpense"));

	Методы.Добавить(Радар_Типы.Метод("Загрузить"));
	Методы.Добавить(Радар_Типы.Метод("Load"));

	Методы.Добавить(Радар_Типы.Метод("ЗагрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("LoadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Индекс"));
	Методы.Добавить(Радар_Типы.Метод("IndexOf"));

	Методы.Добавить(Радар_Типы.Метод("Итог"));
	Методы.Добавить(Радар_Типы.Метод("Total"));

	Методы.Добавить(Радар_Типы.Метод("Количество"));
	Методы.Добавить(Радар_Типы.Метод("Count"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("Очистить"));
	Методы.Добавить(Радар_Типы.Метод("Clear"));

	Методы.Добавить(Радар_Типы.Метод("Получить"));
	Методы.Добавить(Радар_Типы.Метод("Get"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Сдвинуть"));
	Методы.Добавить(Радар_Типы.Метод("Move"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьАктивность"));
	Методы.Добавить(Радар_Типы.Метод("SetActive"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераРегистраНакопления() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("АгрегатыЗаполнены"));
	Методы.Добавить(Радар_Типы.Метод("AggregatesIsFilled"));

	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьПоРегистратору"));
	Методы.Добавить(Радар_Типы.Метод("SelectByRecorder"));

	Методы.Добавить(Радар_Типы.Метод("ОбновитьАгрегаты"));
	Методы.Добавить(Радар_Типы.Метод("UpdateAggregates"));

	Методы.Добавить(Радар_Типы.Метод("Обороты"));
	Методы.Добавить(Радар_Типы.Метод("Turnovers"));

	Методы.Добавить(Радар_Типы.Метод("ОпределитьОптимальныеАгрегаты"));
	Методы.Добавить(Радар_Типы.Метод("DetermineOptimalAggregates"));

	Методы.Добавить(Радар_Типы.Метод("Остатки"));
	Методы.Добавить(Радар_Типы.Метод("Balance"));

	Методы.Добавить(Радар_Типы.Метод("ОчиститьАгрегаты"));
	Методы.Добавить(Радар_Типы.Метод("ClearAggregates"));

	Методы.Добавить(Радар_Типы.Метод("ПерестроитьИспользованиеАгрегатов"));
	Методы.Добавить(Радар_Типы.Метод("RebuildAggregatesUsing"));

	Методы.Добавить(Радар_Типы.Метод("ПересчитатьИтоги"));
	Методы.Добавить(Радар_Типы.Метод("RecalcTotals"));

	Методы.Добавить(Радар_Типы.Метод("ПересчитатьИтогиЗаПериод"));
	Методы.Добавить(Радар_Типы.Метод("RecalcTotalsForPeriod"));

	Методы.Добавить(Радар_Типы.Метод("ПересчитатьТекущиеИтоги"));
	Методы.Добавить(Радар_Типы.Метод("RecalcPresentTotals"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьАгрегаты"));
	Методы.Добавить(Радар_Типы.Метод("GetAgregates"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИспользованиеАгрегатов"));
	Методы.Добавить(Радар_Типы.Метод("GetAggregatesUsing"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИспользованиеИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИспользованиеТекущихИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetPresentTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМаксимальныйПериодРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetMaxTotalsPeriod"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМинимальныйПериодРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetMinTotalsPeriod"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьРежимАгрегатов"));
	Методы.Добавить(Радар_Типы.Метод("GetAggregatesMode"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьРежимРазделенияИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetTotalsSplittingMode"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьКлючЗаписи"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordKey"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьНаборЗаписей"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordSet"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИспользованиеАгрегатов"));
	Методы.Добавить(Радар_Типы.Метод("SetAggregatesUsing"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИспользованиеИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИспользованиеТекущихИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetPresentTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьМаксимальныйПериодРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetMaxTotalsPeriod"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьМинимальныйИМаксимальныйПериодыРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetMinAndMaxTotalsPeriods"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьМинимальныйПериодРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetMinTotalsPeriod"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьРежимАгрегатов"));
	Методы.Добавить(Радар_Типы.Метод("SetAggregatesMode"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьРежимРазделенияИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetTotalsSplittingMode"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область РегистрСведений

Функция ОкружениеФормыЗаписиРегистраСведений() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	//Переменные = Окружение.Переменные;
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));
	
	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеФормыНабораЗаписейРегистраСведений() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	//Переменные = Окружение.Переменные;
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));
	
	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеНабораЗаписейРегистраСведений() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Записывать"));
	Переменные.Добавить(Радар_Типы.Переменная("Write"));

	Переменные.Добавить(Радар_Типы.Переменная("ЗаписьИсторииДанных"));
	Переменные.Добавить(Радар_Типы.Переменная("WriteDataHistory"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("Отбор"));
	Переменные.Добавить(Радар_Типы.Переменная("Filter"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Вставить"));
	Методы.Добавить(Радар_Типы.Метод("Insert"));

	Методы.Добавить(Радар_Типы.Метод("Выбран"));
	Методы.Добавить(Радар_Типы.Метод("Selected"));

	Методы.Добавить(Радар_Типы.Метод("Выгрузить"));
	Методы.Добавить(Радар_Типы.Метод("Unload"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонки"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumns"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Добавить"));
	Методы.Добавить(Радар_Типы.Метод("Add"));

	Методы.Добавить(Радар_Типы.Метод("Загрузить"));
	Методы.Добавить(Радар_Типы.Метод("Load"));

	Методы.Добавить(Радар_Типы.Метод("ЗагрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("LoadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Заполнить"));
	Методы.Добавить(Радар_Типы.Метод("Fill"));

	Методы.Добавить(Радар_Типы.Метод("Индекс"));
	Методы.Добавить(Радар_Типы.Метод("IndexOf"));

	Методы.Добавить(Радар_Типы.Метод("Итог"));
	Методы.Добавить(Радар_Типы.Метод("Total"));

	Методы.Добавить(Радар_Типы.Метод("Количество"));
	Методы.Добавить(Радар_Типы.Метод("Count"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("Очистить"));
	Методы.Добавить(Радар_Типы.Метод("Clear"));

	Методы.Добавить(Радар_Типы.Метод("Получить"));
	Методы.Добавить(Радар_Типы.Метод("Get"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Сдвинуть"));
	Методы.Добавить(Радар_Типы.Метод("Move"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьАктивность"));
	Методы.Добавить(Радар_Типы.Метод("SetActive"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераРегистраСведений() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьПоРегистратору"));
	Методы.Добавить(Радар_Типы.Метод("SelectByRecorder"));

	Методы.Добавить(Радар_Типы.Метод("ПересчитатьИтоги"));
	Методы.Добавить(Радар_Типы.Метод("RecalcTotals"));

	Методы.Добавить(Радар_Типы.Метод("Получить"));
	Методы.Добавить(Радар_Типы.Метод("Get"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИспользованиеИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьПервое"));
	Методы.Добавить(Радар_Типы.Метод("GetFirst"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьПоследнее"));
	Методы.Добавить(Радар_Типы.Метод("GetLast"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуРедактированияЗаписи"));
	Методы.Добавить(Радар_Типы.Метод("GetRecordEditingForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("ПустойКлюч"));
	Методы.Добавить(Радар_Типы.Метод("EmptyKey"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьКлючЗаписи"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordKey"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьМенеджерЗаписи"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordManager"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьНаборЗаписей"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordSet"));

	Методы.Добавить(Радар_Типы.Метод("СрезПервых"));
	Методы.Добавить(Радар_Типы.Метод("SliceFirst"));

	Методы.Добавить(Радар_Типы.Метод("СрезПоследних"));
	Методы.Добавить(Радар_Типы.Метод("SliceLast"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИспользованиеИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetTotalsUsing"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область РегистрБухгалтерии

Функция ОкружениеНабораЗаписейРегистраБухгалтерии() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;

	Переменные.Добавить(Радар_Типы.Переменная("БлокироватьДляИзменения"));
	Переменные.Добавить(Радар_Типы.Переменная("LockForUpdate"));

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Записывать"));
	Переменные.Добавить(Радар_Типы.Переменная("Write"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("Отбор"));
	Переменные.Добавить(Радар_Типы.Переменная("Filter"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Вставить"));
	Методы.Добавить(Радар_Типы.Метод("Insert"));

	Методы.Добавить(Радар_Типы.Метод("Выбран"));
	Методы.Добавить(Радар_Типы.Метод("Selected"));

	Методы.Добавить(Радар_Типы.Метод("Выгрузить"));
	Методы.Добавить(Радар_Типы.Метод("Unload"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонки"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumns"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Добавить"));
	Методы.Добавить(Радар_Типы.Метод("Add"));

	Методы.Добавить(Радар_Типы.Метод("ДобавитьДебет"));
	Методы.Добавить(Радар_Типы.Метод("AddDebit"));

	Методы.Добавить(Радар_Типы.Метод("ДобавитьКредит"));
	Методы.Добавить(Радар_Типы.Метод("AddCredit"));

	Методы.Добавить(Радар_Типы.Метод("Загрузить"));
	Методы.Добавить(Радар_Типы.Метод("Load"));

	Методы.Добавить(Радар_Типы.Метод("ЗагрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("LoadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Индекс"));
	Методы.Добавить(Радар_Типы.Метод("IndexOf"));

	Методы.Добавить(Радар_Типы.Метод("Итог"));
	Методы.Добавить(Радар_Типы.Метод("Total"));

	Методы.Добавить(Радар_Типы.Метод("Количество"));
	Методы.Добавить(Радар_Типы.Метод("Count"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("Очистить"));
	Методы.Добавить(Радар_Типы.Метод("Clear"));

	Методы.Добавить(Радар_Типы.Метод("Получить"));
	Методы.Добавить(Радар_Типы.Метод("Get"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Сдвинуть"));
	Методы.Добавить(Радар_Типы.Метод("Move"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьАктивность"));
	Методы.Добавить(Радар_Типы.Метод("SetActive"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераРегистраБухгалтерии() Экспорт
	
	Окружение = Радар_Типы.Окружение();
		
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьПоРегистратору"));
	Методы.Добавить(Радар_Типы.Метод("SelectByRecorder"));

	Методы.Добавить(Радар_Типы.Метод("Обороты"));
	Методы.Добавить(Радар_Типы.Метод("Turnovers"));

	Методы.Добавить(Радар_Типы.Метод("ОборотыДтКт"));
	Методы.Добавить(Радар_Типы.Метод("DrCrTurnovers"));

	Методы.Добавить(Радар_Типы.Метод("Остатки"));
	Методы.Добавить(Радар_Типы.Метод("Balance"));

	Методы.Добавить(Радар_Типы.Метод("ПересчитатьИтоги"));
	Методы.Добавить(Радар_Типы.Метод("RecalcTotals"));

	Методы.Добавить(Радар_Типы.Метод("ПересчитатьИтогиЗаПериод"));
	Методы.Добавить(Радар_Типы.Метод("RecalcTotalsForPeriod"));

	Методы.Добавить(Радар_Типы.Метод("ПересчитатьТекущиеИтоги"));
	Методы.Добавить(Радар_Типы.Метод("RecalcPresentTotals"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИспользованиеИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьИспользованиеТекущихИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetPresentTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМаксимальныйПериодРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetTotalsPeriod"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМинимальныйПериодРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetMinTotalsPeriod"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьРежимРазделенияИтогов"));
	Методы.Добавить(Радар_Типы.Метод("GetTotalsSplittingMode"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьКлючЗаписи"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordKey"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьНаборЗаписей"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordSet"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИспользованиеИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьИспользованиеТекущихИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetPresentTotalsUsing"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьМаксимальныйПериодРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetMaxTotalsPeriod"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьМинимальныйИМаксимальныйПериодыРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetMinAndMaxTotalsPeriods"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьМинимальныйПериодРассчитанныхИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetMinTotalsPeriod"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьРежимРазделенияИтогов"));
	Методы.Добавить(Радар_Типы.Метод("SetTotalsSplittingMode"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

#Область РегистрРасчета

Функция ОкружениеНабораЗаписейРегистраРасчета() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;

	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Записывать"));
	Переменные.Добавить(Радар_Типы.Переменная("Write"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("Отбор"));
	Переменные.Добавить(Радар_Типы.Переменная("Filter"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Вставить"));
	Методы.Добавить(Радар_Типы.Метод("Insert"));

	Методы.Добавить(Радар_Типы.Метод("Выбран"));
	Методы.Добавить(Радар_Типы.Метод("Selected"));

	Методы.Добавить(Радар_Типы.Метод("Выгрузить"));
	Методы.Добавить(Радар_Типы.Метод("Unload"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонки"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumns"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Добавить"));
	Методы.Добавить(Радар_Типы.Метод("Add"));

	Методы.Добавить(Радар_Типы.Метод("Загрузить"));
	Методы.Добавить(Радар_Типы.Метод("Load"));

	Методы.Добавить(Радар_Типы.Метод("ЗагрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("LoadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Индекс"));
	Методы.Добавить(Радар_Типы.Метод("IndexOf"));

	Методы.Добавить(Радар_Типы.Метод("Итог"));
	Методы.Добавить(Радар_Типы.Метод("Total"));

	Методы.Добавить(Радар_Типы.Метод("Количество"));
	Методы.Добавить(Радар_Типы.Метод("Count"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("Очистить"));
	Методы.Добавить(Радар_Типы.Метод("Clear"));

	Методы.Добавить(Радар_Типы.Метод("Получить"));
	Методы.Добавить(Радар_Типы.Метод("Get"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДополнение"));
	Методы.Добавить(Радар_Типы.Метод("GetAddition"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Сдвинуть"));
	Методы.Добавить(Радар_Типы.Метод("Move"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьАктивность"));
	Методы.Добавить(Радар_Типы.Метод("SetActive"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераРегистраРасчета() Экспорт
	
	Окружение = Радар_Типы.Окружение();
	
	Переменные = Окружение.Переменные;

	Переменные.Добавить(Радар_Типы.Переменная("Перерасчеты"));
	Переменные.Добавить(Радар_Типы.Переменная("Recalculations"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("ВыбратьПоРегистратору"));
	Методы.Добавить(Радар_Типы.Метод("SelectByRecorder"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьБазу"));
	Методы.Добавить(Радар_Типы.Метод("GetBase"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьДанныеГрафика"));
	Методы.Добавить(Радар_Типы.Метод("GetScheduleData"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСписка"));
	Методы.Добавить(Радар_Типы.Метод("GetListForm"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьКлючЗаписи"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordKey"));

	Методы.Добавить(Радар_Типы.Метод("СоздатьНаборЗаписей"));
	Методы.Добавить(Радар_Типы.Метод("CreateRecordSet"));
		
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

#КонецОбласти

Функция ОкружениеМенеджераКритерияОтбора() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	//Переменные = Окружение.Переменные;
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Найти"));
	Методы.Добавить(Радар_Типы.Метод("Find"));
	
	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераПеречисления() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	//Переменные = Окружение.Переменные;
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("ТипВсеСсылки"));
	Методы.Добавить(Радар_Типы.Метод("AllRefsType"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераХранилищаНастроек() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	//Переменные = Окружение.Переменные;
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Загрузить"));
	Методы.Добавить(Радар_Типы.Метод("Load"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьОписание"));
	Методы.Добавить(Радар_Типы.Метод("GetDescription"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуЗагрузки"));
	Методы.Добавить(Радар_Типы.Метод("GetLoadForm"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФормуСохранения"));
	Методы.Добавить(Радар_Типы.Метод("GetSaveForm"));

	Методы.Добавить(Радар_Типы.Метод("Сохранить"));
	Методы.Добавить(Радар_Типы.Метод("Save"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьОписание"));
	Методы.Добавить(Радар_Типы.Метод("SetDescription"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераЖурналаДокументов() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	//Переменные = Окружение.Переменные;
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выбрать"));
	Методы.Добавить(Радар_Типы.Метод("Select"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьМакет"));
	Методы.Добавить(Радар_Типы.Метод("GetTemplate"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьФорму"));
	Методы.Добавить(Радар_Типы.Метод("GetForm"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеНабораЗаписейПоследовательности() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("Отбор"));
	Переменные.Добавить(Радар_Типы.Переменная("Filter"));

	Переменные.Добавить(Радар_Типы.Переменная("Регистратор"));
	Переменные.Добавить(Радар_Типы.Переменная("Recorder"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Выгрузить"));
	Методы.Добавить(Радар_Типы.Метод("Unload"));

	Методы.Добавить(Радар_Типы.Метод("ВыгрузитьКолонки"));
	Методы.Добавить(Радар_Типы.Метод("UnloadColumns"));

	Методы.Добавить(Радар_Типы.Метод("Добавить"));
	Методы.Добавить(Радар_Типы.Метод("Add"));

	Методы.Добавить(Радар_Типы.Метод("Загрузить"));
	Методы.Добавить(Радар_Типы.Метод("Load"));

	Методы.Добавить(Радар_Типы.Метод("ЗагрузитьКолонку"));
	Методы.Добавить(Радар_Типы.Метод("LoadColumn"));

	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Индекс"));
	Методы.Добавить(Радар_Типы.Метод("IndexOf"));

	Методы.Добавить(Радар_Типы.Метод("Количество"));
	Методы.Добавить(Радар_Типы.Метод("Count"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("Модифицированность"));
	Методы.Добавить(Радар_Типы.Метод("Modified"));

	Методы.Добавить(Радар_Типы.Метод("Очистить"));
	Методы.Добавить(Радар_Типы.Метод("Clear"));

	Методы.Добавить(Радар_Типы.Метод("Получить"));
	Методы.Добавить(Радар_Типы.Метод("Get"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("Удалить"));
	Методы.Добавить(Радар_Типы.Метод("Delete"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеМенеджераЗначенияКонстанты() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	Переменные = Окружение.Переменные;
	
	Переменные.Добавить(Радар_Типы.Переменная("ДополнительныеСвойства"));
	Переменные.Добавить(Радар_Типы.Переменная("AdditionalProperties"));

	Переменные.Добавить(Радар_Типы.Переменная("Значение"));
	Переменные.Добавить(Радар_Типы.Переменная("Value"));

	Переменные.Добавить(Радар_Типы.Переменная("ОбменДанными"));
	Переменные.Добавить(Радар_Типы.Переменная("DataExchange"));

	Переменные.Добавить(Радар_Типы.Переменная("ЭтотОбъект"));
	Переменные.Добавить(Радар_Типы.Переменная("ThisObject"));
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));

	Методы.Добавить(Радар_Типы.Метод("Метаданные"));
	Методы.Добавить(Радар_Типы.Метод("Metadata"));

	Методы.Добавить(Радар_Типы.Метод("ПолучитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("GetDataHistoryVersionComment"));

	Методы.Добавить(Радар_Типы.Метод("ПроверитьЗаполнение"));
	Методы.Добавить(Радар_Типы.Метод("CheckFilling"));

	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));

	Методы.Добавить(Радар_Типы.Метод("УстановитьКомментарийВерсииИсторииДанных"));
	Методы.Добавить(Радар_Типы.Метод("SetDataHistoryVersionComment"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции

Функция ОкружениеФормыНабораКонстант() Экспорт
	
	Окружение = Радар_Типы.Окружение(ОкружениеФормы());
	
	//Переменные = Окружение.Переменные;
	
	Методы = Окружение.Методы;
	
	Методы.Добавить(Радар_Типы.Метод("Записать"));
	Методы.Добавить(Радар_Типы.Метод("Write"));
	
	Методы.Добавить(Радар_Типы.Метод("Прочитать"));
	Методы.Добавить(Радар_Типы.Метод("Read"));
	
	Возврат Радар_Типы.ФиксированноеОкружение(Окружение);
	
КонецФункции