
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВнешняяКонфигурация
		И Не ЗначениеЗаполнено(ЭтотОбъект.ПутьКонфигурации) Тогда
		
		Радар_Сервер.СообщитьПолеНеЗаполнено(ЭтотОбъект, "ПутьКонфигурации", Отказ);
		
	КонецЕсли; 
	
	Если Не Радар_КлиентСервер.ЭтоФайловаяБаза()
		И ЭтотОбъект.ИспользоватьМногопоточность Тогда
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.РазмерПартии) Тогда
			
			Радар_Сервер.СообщитьПолеНеЗаполнено(ЭтотОбъект, "РазмерПартии", Отказ);
			
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.МаксимумПотоков) Тогда
			
			Радар_Сервер.СообщитьПолеНеЗаполнено(ЭтотОбъект, "МаксимумПотоков", Отказ);
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры
