
&НаКлиенте
Процедура ОшибкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Строка = Элементы.Ошибки.ТекущиеДанные;
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОбработкаПослеВыбора = Новый ОписаниеОповещения("ОбработкаПослеВыбора", ЭтотОбъект, Строка);
	
	Путь = Неопределено;
	
	Если Строка.Свойство("Путь", Путь) И ЭтотОбъект.ПутьИсходника <> Путь Тогда
		ЭтотОбъект.ПутьИсходника = Путь;
		Исходник.НачатьЧтение(ОбработкаПослеВыбора, ЭтотОбъект.ПутьИсходника, КодировкаТекста.UTF8);
	Иначе
		ОбработкаПослеВыбора(Строка);
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПослеВыбора(Строка) Экспорт
	
	ОбновитьОтображениеДанных(Элементы.Исходник);
	
	Если Не Строка.Свойство("ПозицияНачала")
		Или Не Строка.Свойство("ПозицияКонца") Тогда
		Возврат;
	КонецЕсли; 
	
	Если Строка.ПозицияНачала > 0 Тогда
		ЭтотОбъект.ТекущийЭлемент = ЭтотОбъект.Элементы.Исходник;
		ЭтотОбъект.Элементы.Исходник.УстановитьГраницыВыделения(Строка.ПозицияНачала, Строка.ПозицияКонца);
		ЭтотОбъект.ТекущийЭлемент = ЭтотОбъект.Элементы.Исходник;
	КонецЕсли;
	
КонецПроцедуры 