
&НаКлиенте
Процедура ОбработкаКоманды(Проект, ПараметрыВыполненияКоманды)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = НСтр("ru = 'Укажите имя файла'");

	Адрес = ВыгрузитьОшибкиНаСервере(Проект);
	
	ОписаниеФайла = Новый ОписаниеПередаваемогоФайла;
	ОписаниеФайла.Имя = "generic-issue-report.json";
	ОписаниеФайла.Хранение = Адрес;
	
	Файлы = Новый Массив;
	Файлы.Добавить(ОписаниеФайла);
	
	Заглушка = Новый ОписаниеОповещения("Заглушка", ЭтотОбъект);
	
	НачатьПолучениеФайлов(Заглушка, Файлы, Диалог, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура Заглушка(Результат, Параметры)
		
КонецПроцедуры 

&НаСервере
Функция ВыгрузитьОшибкиНаСервере(Проект)
	
	Адрес = Радар_Сервер.ВыгрузитьОшибкиВСонар(Проект);	
	
	Возврат Адрес;
	
КонецФункции  