
Процедура ВыбратьПуть(Элемент, Форма, РежимДиалога = Неопределено, Фильтр = Неопределено) Экспорт

	Если РежимДиалога = Неопределено Тогда
		РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	КонецЕсли;

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = Фильтр;
	Если РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
		ДиалогВыбораФайла.Каталог = Элемент.ТекстРедактирования;
	Иначе
		ДиалогВыбораФайла.ПолноеИмяФайла = Элемент.ТекстРедактирования;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("Элемент, Форма", Элемент, Форма);

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект, ДополнительныеПараметры);

	ДиалогВыбораФайла.Показать(ОписаниеОповещения);

КонецПроцедуры

Процедура ОбработатьВыборФайла(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ИнтерактивноУстановитьЗначениеЭлементаФормы(
			Результат[0],
			ДополнительныеПараметры.Элемент,
			ДополнительныеПараметры.Форма
		);
	КонецЕсли;

КонецПроцедуры

Процедура ИнтерактивноУстановитьЗначениеЭлементаФормы(Значение, Элемент, Форма) Экспорт

	СтарыйВладелецФормы = Форма.ВладелецФормы;
	ЗакрыватьПриВыборе = Форма.ЗакрыватьПриВыборе;

	Форма.ВладелецФормы = Элемент;
	Форма.ЗакрыватьПриВыборе = Ложь;

	Форма.ОповеститьОВыборе(Значение);

	Если Форма.ВладелецФормы = Элемент Тогда
		Форма.ВладелецФормы = СтарыйВладелецФормы;
	КонецЕсли;

	Если Форма.ЗакрыватьПриВыборе = Ложь Тогда
		Форма.ЗакрыватьПриВыборе = ЗакрыватьПриВыборе;
	КонецЕсли;
	
	Форма.ОбновитьОтображениеДанных(Элемент);
	
КонецПроцедуры